app/Controllers/PlaylistController.php

SELECT *
FROM `playlists`
---
    public function index()
    {
        $data = [
            'pageTitle' => 'Playlist'
        ];
        $playlistModel = new PlaylistModel();
        $data['playlists'] = $playlistModel->findAll(); // Asumsinya $playlistModel adalah instance model.

UPDATE `playlists` SET `name` = 'Musik 1', `description` = 'iguuykts x'
WHERE `playlists`.`id` IN ('1')
---
    public function update($id)
    {
        $data = [
            'name' => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
        ];

        $this->modelPlaylist->update($id, $data);