app/Models/MusikModel.php

SELECT `musik`.*, `playlists`.`name` AS `playlist_name`
FROM `musik`
LEFT JOIN `playlists` ON `playlists`.`id` = `musik`.`playlist_name`
---
    public function getMusikWithPlaylists()
    {
        return $this->db->table('musik')
            ->select('musik.*, playlists.name AS playlist_name') // Pilih nama playlist
            ->join('playlists', 'musik.playlist_name = playlists.id', 'left') // Gabungkan dengan tabel playlists
            ->get()
            ->getResultArray();